hs19/sonicFoam_examples/ras/prism/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (650 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (650 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    bottomWall
    {
        type            supersonicFreestream;
        pInf            100000;
        TInf            300;
        UInf            (650 0 0);
        gamma           1.28418;
        value           uniform (650 0 0);
    }

    topWall
    {
        type            supersonicFreestream;
        pInf            100000;
        TInf            300;
        UInf            (650 0 0);
        gamma           1.28418;
        value           uniform (650 0 0);
    }

    prismWall
    {
        type            noSlip;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
